{
  "chalmers_engineering_programs": [
    {
      "name": "Architecture and Technology",
      "field": "Architecture",
      "explanation": "Combines creative architectural design with solid engineering principles to equip students for shaping the built environment. Students learn to develop sustainable, intelligent, and aesthetically pleasing structures that address both environmental and societal needs. The program emphasizes hands-on studio projects, digital tools, and interdisciplinary collaboration."
    },
    {
      "name": "Automation and Mechatronics",
      "field": "Automation and Mechatronics",
      "explanation": "Focuses on intelligent systems that integrate mechanics, electronics, and software. Students explore robotics, control systems, and automation technologies used in manufacturing, transport, and modern gadgets. The program prepares students to design, build, and optimize machines that interact with the physical world using sensors and feedback systems."
    },
    {
      "name": "Biotechnology",
      "field": "Chemical and Biotechnology",
      "explanation": "Explores how biological systems can be engineered to solve problems in healthcare, agriculture, and sustainability. Students study molecular biology, bioprocessing, and chemical engineering to develop products like vaccines, renewable materials, and environmental solutions. The program balances theory with lab-based innovation and ethical considerations."
    },
    {
      "name": "Computer Science and Engineering",
      "field": "Computer Science",
      "explanation": "Prepares students to build the digital technologies that power society. The program covers programming, algorithms, data science, artificial intelligence, and cybersecurity. It equips students with both theoretical and practical skills to design software systems, solve computational problems, and innovate in fields like fintech, healthtech, and robotics."
    },
    {
      "name": "Electrical Engineering",
      "field": "Electrical Engineering",
      "explanation": "Covers the generation, transmission, and use of electrical energy and information. Students delve into embedded systems, power electronics, signal processing, and smart grids. The program emphasizes real-world applications, from renewable energy systems to communication networks and intelligent hardware design."
    },
    {
      "name": "Global Systems",
      "field": "Engineering Physics, Engineering Mathematics and Global Systems",
      "explanation": "Prepares students to tackle global challenges using systems thinking and analytical tools. The program focuses on climate systems, urban sustainability, and global governance through an engineering lens. Students develop models and strategies that consider complexity, uncertainty, and long-term impacts on people and the planet."
    },
    {
      "name": "Industrial Engineering and Management",
      "field": "Industrial Engineering",
      "explanation": "Bridges the gap between engineering and business. Students learn operations research, innovation management, logistics, and entrepreneurship. The program equips students to lead technical projects, manage organizations, and drive change in industries such as manufacturing, consulting, and tech."
    },
    {
      "name": "Information Technology",
      "field": "Information Technology",
      "explanation": "Blends computing with communication and software development. Students work on building secure, scalable, and user-friendly systems that connect people and data. The program covers databases, web technologies, networking, and human-computer interaction, preparing students for careers in IT infrastructure, development, and consulting."
    },
    {
      "name": "Mechanical Engineering and Technical Design",
      "field": "Mechanical Engineering and Technical Design",
      "explanation": "Combines classical mechanical engineering with product development and innovation methods. Students design and prototype everything from engines and industrial tools to consumer gadgets. The program includes simulation, CAD, materials science, and manufacturing processes, preparing students to turn ideas into functional and elegant solutions."
    },
    {
      "name": "Medical Engineering",
      "field": "Electrical Engineering",
      "explanation": "Applies engineering methods to healthcare challenges. Students learn to design medical devices, diagnostics, and digital health systems. The program combines electronics, physiology, signal analysis, and biomedical innovation, aiming to improve diagnosis, treatment, and patient care through smart technologies."
    },
    {
      "name": "Civil and Environmental Engineering",
      "field": "Civil and Environmental Engineering",
      "explanation": "Focuses on designing infrastructure and protecting natural resources. Students work on projects related to construction, water treatment, transportation systems, and climate resilience. The program emphasizes sustainable practices, urban planning, and engineering solutions for a growing and changing world."
    },
    {
      "name": "Technical Design",
      "field": "Mechanical Engineering and Technical Design",
      "explanation": "Emphasizes creative product development rooted in technical expertise. Students are trained in design thinking, engineering mechanics, and prototyping. The program prepares students to bridge form and function—crafting products that are both technically robust and user-friendly, often working in interdisciplinary teams."
    },
    {
      "name": "Engineering Physics",
      "field": "Engineering Physics, Engineering Mathematics and Global Systems",
      "explanation": "Delivers a rigorous foundation in mathematics, physics, and computational modeling. Students study quantum mechanics, nanotechnology, and photonics, preparing them for research and advanced technology development. This program suits those with strong analytical abilities and curiosity about the fundamental laws of nature."
    },
    {
      "name": "Chemical Engineering",
      "field": "Chemical and Biotechnology",
      "explanation": "Covers how to convert raw materials into useful products through chemical processes. Students study reaction engineering, thermodynamics, and process control. The program supports careers in energy, materials, food, and pharmaceuticals with a strong focus on sustainability and efficiency."
    },
    {
      "name": "Engineering Mathematics",
      "field": "Engineering Physics, Engineering Mathematics and Global Systems",
      "explanation": "Equips students to solve complex problems through mathematical modeling and simulation. Topics include optimization, machine learning, fluid dynamics, and systems control. The program is ideal for those who enjoy abstraction and want to apply mathematical tools in engineering, finance, or research."
    }
  ],
  "metadata": {
    "total_programs": 15,
    "source": "Chalmers University of Technology",
    "url": "https://www.chalmers.se/utbildning/hitta-program/",
    "last_updated": "2025-06-27"
  }
}
